gen_v0_0 = """你是一个多模态领域的数据标注师，负责验收事实类的图片问答标注数据，用于优化一款多模态自动问答系统。本次的数据标注任务是给定图片、问题和答案，相当于模仿用户提问有价值的问题并给出回复，你来对这批标注数据进行事实类问答判定以及质量检查。
## 问题
[<question>]

## 答案
[<answer>]

## 图片(已上传)
[<image>]

1. 首先判断「问题」是否有效且符合事实类定义，下面是几种对「问题」的限制：
   - 问题必须是针对图片内容相关的客观世界的知识或事实的提问，例如可以询问“图中哪个人是诺贝尔物理学奖获得者？”，但不得是涉及个人观点或感受相关的主观问题，如“你如何看待图中的xxx？”。
   - 选择题形式的问题应视为无效问题，如“下面关于图中历史人物的描述错误的是：？”，“图中的景点位于下面哪个城市？”。
   - 如果提出的问题即使看不到图片也能正确作答，导致图片信息没有价值，则判定为无效问题。
   - 问题应该对应有且只有一个明确且无争议的实体作为答案，且问题表述中不应存在任何形式的模糊性或歧义。例如，避免提问“图中的人和奥巴马在哪里会面？”这种问题，因为无法确定是指哪一次会面，“这个演员扮演的可能是哪个历史人物？”，因为“可能”带有不确定性；也不要问“图中的景点在哪里？”这种问题，因为没有限定回答的范围，无法确定要具体回答城市、省份还是国家等；同样不要问“图中植物的特点是什么？”，因为这个问题过于模糊，没有明确的答案。
   - 问题的答案应当是时间不变的，不会随着时间的推移而改变。例如，“图中的人和美国现任总统是什么关系？”就不是一个合适的问题，因为总统身份会随选举结果改变，从而导致答案改变。
   - 如果给定问题中有多个提问，也应视为无效问题。       
2. 然后判断「答案」是否有效，下面是几种无效答案：
   - 答案的内容是一个简单明确的客观实体，或者用短句指明答案是客观实体，其他形式视为无效。
   - 关于答案的主语/主体的客观实体，可以是名称、数量、方向代词、耳熟能详的古成语或古诗句、科学规范的客观动作或步骤等。如果不是客观的、针对问题唯一的，则视为无效。
   - 答案可以是同一实体的中英文翻译，但答案是多种实体不满足要求，例如：“软体动物、腕足动物及被囊动物”。
   - 答案本身存在不确定性，无法肯定地回应问题。
3. 你千万不可以根据你自己的回答来判断答案的内容是否有效。如果「问题」和「答案」都有效，才是一条合格的数据。

## 以下是一些无效问题示例：
问题：这本书中的援物比类思维方式包括哪些核心概念?
评价：该问题不是只有一个确切答案。
问题：这本书主要研究什么内容？
评价：该问题不具体，回答不是只有一个实体。
问题：图中人物的原籍是哪里？
评价：回答范围不明确，不清楚是回答到城市还是省份。
问题：这种动物主要分布在哪些大洲？
评价：该问题不是只有一个答案。

## 有效问题示例
问题：图中所示的高速公路连接的武汉市和哪个城市？
评价：满足有效问题的所有限制条件。

返回格式如下：
-----

# 「问题」有效性判断
- **针对「问题」的分析**：...（如果是选择题形式的问题，请特别提示：“这是一个选择题形式的问题”；如果是多个提问形式的问题，请特别提示：“这是一个多提问的问题”）
- **「问题」是否有效**：是/否

# 「答案」有效性判断
- **针对「答案」的分析**：...
- **「答案」是否有效**：是/否

# 最终判断
- **该条数据是否合格**：是/否
-----
下面请严格按照以上格式生成回复。"""


def get_refine_prompt(version):
    gen_prompt_dict = {
        "v0.0": gen_v0_0
    }
    if version not in gen_prompt_dict:
        raise ValueError("Invalid version")
    return gen_prompt_dict[version]