
gen_v0_0 = """你是一个多模态领域的数据标注师，负责为事实类的图片问答数据打标签和分类，用于优化一款多模态自动问答系统。本次的数据标注任务是给定图片、问题、答案，你通过给定的信息来对这批数据进行任务分类、问答形式分类和主题/场景分类。
## 问题
[<question>]

## 答案
[<answer>]

## 图片(已上传)
[<image>]

1. 首先判定「图片、问题和答案」符合的任务分类，下面是可选的对VQA数据所属任务的定义：
   - 图中目标识别：
   - 图片内容溯源。
   - 图片内容对比分析。
   - 数理知识推理问答。
   - OCR识别。
   - 动作和情绪识别。
   - 位置状态识别。
   - 事件相关时间问答。
   - 目标对象属性推理。
   - 性质和功能推理。
   - 空间关系推理。
   - 图像质量分析对比。
   - 身份推理。
   - 图像风格识别。
   - 问题缺失内容问答。
   - 事件因果关系推理。
   - 自然和社会关系推理。
   - 问答容错能力验证。
2. 然后判断「图片、问题和答案」符合的问答形式，下面是可选的对VQA数据问答形式的定义：
   - 短问题-富信息图片VQA
   - 短问题-简洁图片VQA
   - 长问题-富信息图片VQA
   - 长问题-简洁图片VQA
3. 然后判断「图片、问题和答案」符合的主题类别，可选的主题类别包括但不限于：
   - “中西文化”
   - “历史”
   - “工程、技术和应用”
   - “文艺、生活和艺术”
   - “社会”
   - “自然科学”
   - “教育”
   - “文学”
4. 最后根据「图片」展示的内容，给VQA数据一个简洁明了的实体类别,这些实体分类包括但不限于：
   - 影视
   - 动漫
   - 景点
   - 建筑
   - 人物
   - 文物
   - 餐饮
   - 服饰
   - 书画
   - 软件
   - 法律
   - 书籍
   ...

返回格式如下：
-----

# 本问答示例的各种所属类别
- **针对「任务类别」的分析**：...
- **所属「任务类别」**：从可选的任务类别里选择
- **针对「问答形式」的分析**：...
- **所属「问答形式」**：从可选的问答形式里选择
- **针对「主题类别」的分析**：...
- **所属「主题类别」**：结合背景知识判别本问答涉及的领域
- **针对「实体类别」的分析**：...
- **问答主体所属「实体类别」**：结合图片和问答判别被提问的主体是什么分类

-----
下面请严格按照以上格式生成回复。"""

gen_v0_1 = """
你是一个多模态领域的数据标注师，负责为事实类的图片问答数据打标签和分类，用于优化一款多模态自动问答系统。本次的数据标注任务是给定图片、问题、答案，你通过给定的信息来对这批数据进行任务分类、问答形式分类和主题/场景分类。
## 问题
[<question>]

## 答案
[<answer>]

## 图片(已上传)
[<image>]

1. 首先判定「图片、问题和答案」符合的任务分类，下面是可选的对VQA数据所属任务的定义：
   - 图中目标识别：最基础的一类任务，直接识别图中的人或物，常见的提问如：“图中的人是谁？”，“这只猫是什么品种？”，“这件文物是什么？”，“这栋建筑叫什么？”，“这是什么东西？”，“这个演员扮演的是哪个角色？”，“图中的菜属于我国哪个菜系？”等等。
   - 图片内容溯源：询问图片中目标实体的出处，常见的提问如：“图中的人物出自哪部动漫？”，“图中的文物收藏在哪个博物馆？”，“这个文物出土自哪个城市？”，“图中的建筑在哪个城市？”，“这个人的祖籍是哪里？”等；
   - 图片内容对比分析：问题表现出“比较图中两个及以上实体或实验过程，并得出结论”的意图，常见的提问如“图中三个地点哪个离北京最远？”，“图中的溶液哪个浓度更高/最高？”，“图中的三家银行共同位于哪个国家？”，“图中的诺贝尔奖得主是谁？”等。
   - 数理知识推理问答：提问内容是一个有明确答案的数学、物理、计算机等相关的学科问题。
   - OCR识别：需要识别和阅读图中的文本内容来回答的问题。需要同时结合图片内容和问题来判定。
   - 动作或运动识别：识别人们熟知的运动或动作状态，常见的提问如“图中展示的是哪项运动？”，“图中的人在进行什么实验？”等。
   - 位置状态识别：看图识别某个位置的某个实体，常见的提问如“图中标记为C的地区是哪个省？”，“图中标记为A的地区是哪个国家？”，“图中从左边数第三个人是谁？”，“这张照片拍摄于哪个国家？”等。
   - 事件相关时间问答：与事件有关的问答，常见的提问如“图中人物出生于哪一年？”，“图中文物出土于哪一年？”，“图中人物哪年哪月第一次获得金像奖？”等。
   - 目标对象属性推理：提问目标实体的年龄、所属朝代、颜色、材质等常识范围中的属性。
   - 性质和功能推理：与目标实体或某个实验的成果的用途和主要功能相关的问答，常见的提问如“图中的器材用来做什么实验？”，“图中的工具做什么用途？”等。
   - 空间关系推理：与空间关系有关的常识性问答，常见的提问如“图中的城市b在北京的哪个方位？”，“图中最上方的是什么？”，“图中最里侧是什么动物？”，“图中的景点在南京的哪个方位？”等。
   - 身份推理：看图推理人物的工作、职位等，常见的提问如“本图中人物的工作是？”，“图中的人物是第几届美国总统？”，“图中的人物就职于哪家互联网公司？”等；
   - 图像风格识别：分析图片中的实体（建筑、艺术品或传统工艺品等）的创作风格、流派等名称，常见的提问如“这幅画描绘的是什么流派的风格？”，“这是什么戏曲流派的服饰？”，“这栋建筑属于什么建筑风格”等；
   - 问题缺失内容问答：填空题形式的看图问答。
   - 事件(因果关系)推理：提问导致某件事发生的是什么人或识别热点、常识事件，如“图中描绘的是我国革命时期的那次会议？”，“由于谁的举报，使图中的罪犯落网？”，“这张照片反映的背景是哪次活动？”等；
   - 自然和社会关系推理：关于自然界生物关系、人物血缘关系或社会关系的问答。如：“图中的两种动物属于自然界/食物链中的哪种关系？”，“图中的人物和奥巴马总统是什么关系？”等；
2. 然后判断「图片、问题和答案」符合的主题类别，可选的主题类别包括但不限于：
   - “中西文化”
   - “历史”
   - “工程、技术和应用”
   - “文艺、生活和艺术”
   - “当代社会”
   - “自然科学”
   - “教育”
   - “文学”
3. 最后根据「图片」展示的内容，给VQA数据一个简洁明了的实体类别,这些实体分类包括但不限于：
   - 影视
   - 动漫
   - 景点
   - 建筑
   - 人物
   - 文物
   - 餐饮
   - 服饰
   - 书画
   - 软件
   - 法律
   - 书籍
   ...

返回格式如下：
-----

# 本问答示例的各种所属类别
- **针对「任务类别」的分析**：...
- **所属「任务类别」**：从可选的任务类别里选择
- **针对「主题类别」的分析**：...
- **所属「主题类别」**：结合背景知识判别本问答涉及的领域
- **针对「实体类别」的分析**：...
- **问答主体所属「实体类别」**：结合图片和问答判别被提问的主体是什么分类

-----
下面请严格按照以上格式生成回复。
"""
def get_refine_prompt(version):
    gen_prompt_dict = {
        "v0.0": gen_v0_0,
        "v0.1": gen_v0_1,
    }
    if version not in gen_prompt_dict:
        raise ValueError("Invalid version")
    return gen_prompt_dict[version]